## 多继承

```cpp
class A{
    public:
    int a;
}
class B{
    public:
    int a;
}
class C:public B,public B{
    public:
    int c;
}

void test1(){
    C p;
    p.A::a=10;
    p.B::a=20;
    p.c=30;
}

int main(){
    
    return 0;
}
```

### 菱形继承 和 虚继承

```cpp
class animal{
public:
    int age;
};
class sheep:virtual public animal{ // 虚继承
public:
    int id;
};
class camel:virtual public animal{
    int num_camel;
};

class 神兽:public sheep,public camel{ // Shensou
public:
    int a;
};

int main(){
    神兽 p;
    // p.age = 100; //二义性问题，指定作用域 p.sheep::age=100;
    //p.age=100;
    
    return 0;
}
```

### 虚继承的实现原理

右键解决方案→属性→C/C++→命令行，在其它选项中输入`/d1 reportAllClassLayout`

```bash
cl /d1 reportSingleClassLayoutanimal main.cpp
```

```bash
class animal  size(4):
0    age
```

```bash
cl /d1 reportSingleClassLayoutsheep main.cpp
```

```bash
class sheep  size(12):
0    vbptr
4    id
	(virtual base animal)
8    age

sheep::$vbtable@:
0	0
1	8(sheepd(sheep+0)animal)
```

```bash
cl /d1 reportSingleClassLayoutcamel main.cpp
```

```bash
class animal  size(12):
0    vbptr
4    num_camel
	(virtual base animal)
8    age

camel::$vbtable@:
0	0
1	8(cameld(camel+0)animal)
```

```bash
cl /d1 reportSingleClassLayoutShenshou main.cpp
```

```bash
class Shenshou  size(24):
0    vbptr
4    num_camel
	(virtual base animal)
8    age

camel::$vbtable@:
0	0
1	8(cameld(camel+0)animal)
```

**生成后：**

```bash
1>class animal	size(4):
1>	+---
1> 0	| age


##############
1>class sheep	size(12):
1>	+---
1> 0	| {vbptr}
1> 4	| id
1>	+---
1>	+--- (virtual base animal)
1> 8	| age
1>	+---
1>sheep::$vbtable@:
1> 0	| 0
1> 1	| 8 (sheepd(sheep+0)animal)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>          animal       8       0       4 0

#############
1>class camel	size(12):
1>	+---
1> 0	| {vbptr}
1> 4	| num_camel
1>	+---
1>	+--- (virtual base animal)
1> 8	| age
1>	+---
1>camel::$vbtable@:
1> 0	| 0
1> 1	| 8 (cameld(camel+0)animal)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>          animal       8       0       4 0

################
1>class Shenshou	size(24):
1>	+---
1> 0	| +--- (base class sheep)
1> 0	| | {vbptr}
1> 4	| | id
1>	| +---
1> 8	| +--- (base class camel)
1> 8	| | {vbptr}
1>12	| | num_camel
1>	| +---
1>16	| a
1>	+---
1>	+--- (virtual base animal)
1>20	| age
1>	+---
1>Shenshou::$vbtable@sheep@:
1> 0	| 0
1> 1	| 20 (Shenshoud(sheep+0)animal)
1>Shenshou::$vbtable@camel@:
1> 0	| 0
1> 1	| 12 (Shenshoud(camel+0)animal)
1>vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
1>          animal      20       0       4 0
```

![](.\images\test_uml.png)

![image-20201103222441431](.\images\image-20201103222441431.png)

- animal类4个字节，一个成员age

- vbptr 即virtual base pointer
- 对于sheep类，起始位置是一个虚表指针`vbptr`，占用4字节，指向一张表`vbtable`。然后看到下方的age的偏移量是8。再看一下虚表里的那个8。
  - `sheep p; p.age;`编译器首先找到虚表指针`(*(int*)&p)`，再转成`(int *)`,再*取出得到8
- 对于Shenshou类，前面两个是按照继承顺序的内存排布的基类sheep的虚表指针和成员，基类camel的虚表指针和成员（两个虚基类指针）